In [1]:
#시리즈와 데이터 프레임 데이터 생성
import pandas as pd

In [2]:
s=pd.Series(['banana',40]) #클래스이름()=> 생성자(constructor)함수
#default로 index는 0으로 부여됨.
s

0    banana
1        40
dtype: object

In [3]:
#문자 index를 만들자!
#Series()의 인자로 index=[원하는 index값, ... ]
s=pd.Series(['banana',40],index=[5,10])
s

5     banana
10        40
dtype: object

In [4]:
s=pd.Series(['banana',40],index=['first','second']) #클래스이름()=> 생성자(constructor)함수
s

first     banana
second        40
dtype: object

In [5]:
print(s[1])
print(s['first'])

40
banana

In [6]:
#데이터 프레임 만들기
people=pd.DataFrame({
    'Name':['Kim','Lee'],
    'Occupation':['student','Chemist'],
    'Born':['1920-07-25','1876-06-13'],
    'Died':['1958-04-16','1937-10-16'],
    'Age':[37,66]
},index=[5,10]) #데이터 프레임 생성시, 인덱스를 지정해줄수 있다.

people

   Name Occupation        Born        Died  Age
5   Kim    student  1920-07-25  1958-04-16   37
10  Lee    Chemist  1876-06-13  1937-10-16   66

In [7]:
#데이터 프레임 만들기
people=pd.DataFrame({
    'Name':['Kim','Lee'],
    'Occupation':['student','Chemist'],
    'Born':['1920-07-25','1876-06-13'],
    'Died':['1958-04-16','1937-10-16'],
    'Age':[37,66]
},index=['Kim','Lee']) #데이터 프레임 생성시, 인덱스를 지정해줄수 있다.
people

    Name Occupation        Born        Died  Age
Kim  Kim    student  1920-07-25  1958-04-16   37
Lee  Lee    Chemist  1876-06-13  1937-10-16   66

In [8]:
#데이터 프레임 만들기
people=pd.DataFrame({
    'Occupation':['student','Chemist'],
    'Born':['1920-07-25','1876-06-13'],
    'Died':['1958-04-16','1937-10-16'],
    'Age':[37,66]
},index=['Kim','Lee'],
columns=['Occupation','Born','Age','Died']) #데이터 프레임 생성시, 인덱스를 지정해줄수 있다.

people

    Occupation        Born  Age        Died
Kim    student  1920-07-25   37  1958-04-16
Lee    Chemist  1876-06-13   66  1937-10-16

In [9]:
first_row=people.loc['Lee']
type(first_row)

pandas.core.series.Series

In [10]:
first_row.index #index를 추출하는 속성

Index(['Occupation', 'Born', 'Age', 'Died'], dtype='object')

In [11]:
first_row.values #값들을 추출

array(['Chemist', '1876-06-13', 66, '1937-10-16'], dtype=object)

In [12]:
first_row.keys()

Index(['Occupation', 'Born', 'Age', 'Died'], dtype='object')

In [13]:
first_row.keys()[0]

'Occupation'

In [14]:
ages=people['Age']
print(ages.mean())
print(ages.min())
print(ages.max())
print(ages.std()) #표준편차 / stadard div

51.5
37
66
20.506096654409877

In [15]:
scientists=pd.read_csv("data/scientists.csv")
scientists

                   Name        Born        Died  Age          Occupation
0     Rosaline Franklin  1920-07-25  1958-04-16   37             Chemist
1        William Gosset  1876-06-13  1937-10-16   61        Statistician
2  Florence Nightingale  1820-05-12  1910-08-13   90               Nurse
3           Marie Curie  1867-11-07  1934-07-04   66             Chemist
4         Rachel Carson  1907-05-27  1964-04-14   56           Biologist
5             John Snow  1813-03-15  1858-06-16   45           Physician
6           Alan Turing  1912-06-23  1954-06-07   41  Computer Scientist
7          Johann Gauss  1777-04-30  1855-02-23   77       Mathematician

In [16]:
ages=scientists['Age']

In [17]:
ages

0    37
1    61
2    90
3    66
4    56
5    45
6    41
7    77
Name: Age, dtype: int64

In [18]:
print(ages.mean())
print(ages.min())
print(ages.max())
print(ages.std()) #표준편차 / stadard div)

59.125
37
90
18.325918413937288

In [19]:
#boolean 추출.
#특정 조건을 만족하는 값만 추출.
#목표 :: 평균 나이보다 나이가 많은 사람의 데이터를 추출

ages > ages.mean() #평균보다 나이가 많은 사람--> True, 아니면 False

0    False
1     True
2     True
3     True
4    False
5    False
6    False
7     True
Name: Age, dtype: bool

In [20]:
ages[ages > ages.mean()] #조건식을 만족한 값들만 추출 (불린 추출)
#[ages>ages.mean() == [True, True,... ]]
#broadcasting :: 1개 -> ages의 row개수인 8개로 확장된다. -> 비교수행

1    61
2    90
3    66
7    77
Name: Age, dtype: int64

In [21]:
ages #vector

0    37
1    61
2    90
3    66
4    56
5    45
6    41
7    77
Name: Age, dtype: int64

In [22]:
ages+ages  #벡터의 덧셈(동일한 인덱스에 있는 값들끼리 덧셈)

0     74
1    122
2    180
3    132
4    112
5     90
6     82
7    154
Name: Age, dtype: int64

In [23]:
ages*ages #벡터 요소간 곱셈(element-wise product) == 벡터의 내적

0    1369
1    3721
2    8100
3    4356
4    3136
5    2025
6    1681
7    5929
Name: Age, dtype: int64

In [24]:
ages+100  #벡터+스칼라 =-> 벡터 // 스칼라가 브로드캐스팅을 해서 각 벡터 요소마다 덧셈을 수행할 수 있다.

0    137
1    161
2    190
3    166
4    156
5    145
6    141
7    177
Name: Age, dtype: int64

In [25]:
ages*2

0     74
1    122
2    180
3    132
4    112
5     90
6     82
7    154
Name: Age, dtype: int64

In [26]:
pd.Series([1,100]) #Vector

0      1
1    100
dtype: int64

In [27]:
ages+pd.Series([1,100])
#Vector + Vector => Vector, but v1(x1,y1), v2(x2,y2) 에서 y1==y2이어야 한다.
# 따라서 위의 연산은 인덱스가 일치한 곳만 계산되게 된다.

0     38.0
1    161.0
2      NaN
3      NaN
4      NaN
5      NaN
6      NaN
7      NaN
dtype: float64

In [28]:
ages+pd.Series([1,100],index=[1000,2000])
#위의 연산에서는 일치하는 인덱스가 존재하지 않기 때문에
#모든 연산의 결과가 NaN으로 나오게 된다.

0      NaN
1      NaN
2      NaN
3      NaN
4      NaN
5      NaN
6      NaN
7      NaN
1000   NaN
2000   NaN
dtype: float64

NaN : 누락값 => 3+NaN = NaN

In [29]:
rev_ages=ages.sort_index(ascending=False)  #ascending=True (오름차순), ascneding=False(내림차순) //index기준

In [30]:
ages.sort_values(ascending=False) #ascending=True (오름차순), ascneding=False(내림차순) //value 기준

2    90
7    77
3    66
1    61
4    56
5    45
6    41
0    37
Name: Age, dtype: int64

In [31]:
#평균나이보다 값이 큰 나이를 갖는 사람들만 출력

scientists[scientists['Age'] > scientists['Age'].mean()]

                   Name        Born        Died  Age     Occupation
1        William Gosset  1876-06-13  1937-10-16   61   Statistician
2  Florence Nightingale  1820-05-12  1910-08-13   90          Nurse
3           Marie Curie  1867-11-07  1934-07-04   66        Chemist
7          Johann Gauss  1777-04-30  1855-02-23   77  Mathematician

In [32]:
scientists.loc[[True,True,False,True]] #0,1,3 추출

                Name        Born        Died  Age    Occupation
0  Rosaline Franklin  1920-07-25  1958-04-16   37       Chemist
1     William Gosset  1876-06-13  1937-10-16   61  Statistician
3        Marie Curie  1867-11-07  1934-07-04   66       Chemist

In [33]:
scientists*2  #dataframe에 대한 곱셈 -> 문자열 n번 반복, 정수 n배

,Name,Born,Died,Age,Occupation
0,Rosaline FranklinRosaline Franklin,1920-07-251920-07-25,1958-04-161958-04-16,74,ChemistChemist
1,William GossetWilliam Gosset,1876-06-131876-06-13,1937-10-161937-10-16,122,StatisticianStatistician
2,Florence NightingaleFlorence Nightingale,1820-05-121820-05-12,1910-08-131910-08-13,180,NurseNurse
3,Marie CurieMarie Curie,1867-11-071867-11-07,1934-07-041934-07-04,132,ChemistChemist
4,Rachel CarsonRachel Carson,1907-05-271907-05-27,1964-04-141964-04-14,112,BiologistBiologist
5,John SnowJohn Snow,1813-03-151813-03-15,1858-06-161858-06-16,90,PhysicianPhysician
6,Alan TuringAlan Turing,1912-06-231912-06-23,1954-06-071954-06-07,82,Computer ScientistComputer Scientist
7,Johann GaussJohann Gauss,1777-04-301777-04-30,1855-02-231855-02-23,154,MathematicianMathematician

In [34]:
#시리즈를 생성해서 s변수에 대입
#도시명:인덱스, 수치:데이터
s=pd.Series([9904312,3448737,2890451,2466052],index=["서울","부산",'인천','대구'])
s.index
s.values

s.name="인구" #데이터에 이름이 붙음
s.index.name="도시명"
s

도시명
서울    9904312
부산    3448737
인천    2890451
대구    2466052
Name: 인구, dtype: int64

In [35]:
#100만 단위로 인구가 출력되도록 코드를 작성
#9904312 ->9.904312

s/1000000

도시명
서울    9.904312
부산    3.448737
인천    2.890451
대구    2.466052
Name: 인구, dtype: float64

In [36]:
s["부산"]

3448737

In [37]:
s[[0,3,1]]

도시명
서울    9904312
대구    2466052
부산    3448737
Name: 인구, dtype: int64

In [38]:
s[["서울","대구","부산"]]

도시명
서울    9904312
대구    2466052
부산    3448737
Name: 인구, dtype: int64

In [39]:
s[(s < 5000000) & (s > 2500000)]  #여러개의 조건을 '&'을 사용하여 연결

도시명
부산    3448737
인천    2890451
Name: 인구, dtype: int64

In [40]:
s[(s < 500e4) & (s > 250e4)]  #e:exponent => e4 ==10의 4승=10000

도시명
부산    3448737
인천    2890451
Name: 인구, dtype: int64

In [41]:
s[1:3] #범위를 나타낼때는 대괄호를 안에 쓰지 않는다. i:j => i부터 j-1까지

도시명
부산    3448737
인천    2890451
Name: 인구, dtype: int64

In [42]:
s["부산":"대구"] #부산 부터 대구까지 모두 추출됨.

도시명
부산    3448737
인천    2890451
대구    2466052
Name: 인구, dtype: int64

In [43]:
s2=pd.Series(range(10,13)) 
s2=pd.Series(range(10,13),index=['a','b','c']) #행 인덱스를 a,b,c로 설정

In [44]:
s2[1]

11

In [45]:
#인덱스가 영문자로 된 경우에는 점으로도 접근 가능
s2.a

10

In [46]:
s

도시명
서울    9904312
부산    3448737
인천    2890451
대구    2466052
Name: 인구, dtype: int64

In [47]:
"서울" in s #"서울"이라는 인덱스가 s에 있나?

True

In [48]:
s.values
list(s.items()) #인덱스와 데이터가 모두 추출

[('서울', 9904312), ('부산', 3448737), ('인천', 2890451), ('대구', 2466052)]

In [49]:
for k,v in s.items():
    print(k,v)

서울 9904312
부산 3448737
인천 2890451
대구 2466052

In [50]:
s2=pd.Series([9600000,3300000,2600000,1500000],index=["서울","부산",'인천','대전'])
s=pd.Series([9904312,3448737,2890451,2466052],index=["서울","부산",'인천','대구'])

In [51]:
s

서울    9904312
부산    3448737
인천    2890451
대구    2466052
dtype: int64

In [52]:
s2

서울    9600000
부산    3300000
인천    2600000
대전    1500000
dtype: int64

In [53]:
ds=s-s2
ds
#s와 s2 모두 다 가지고 있는 인덱스의 데이터만 연산이 수행됨.
#Nan이 포함되어 있는 경우에는 연산결과가 float으로 나옴.

대구         NaN
대전         NaN
부산    148737.0
서울    304312.0
인천    290451.0
dtype: float64

In [54]:
ds.notnull() #ds의 값들이 NULL(값이 없음)인가?

대구    False
대전    False
부산     True
서울     True
인천     True
dtype: bool

In [55]:
ds[ds.notnull()] #ds의 값들 중 NaN이 아닌 값들만 추출됨.

부산    148737.0
서울    304312.0
인천    290451.0
dtype: float64

In [56]:
rs=(s-s2)/s2 *100
rs=rs[rs.notnull()]
rs

부산     4.507182
서울     3.169917
인천    11.171192
dtype: float64

In [57]:
rs["부산"]=1.63 #데이터 변경
rs

부산     1.630000
서울     3.169917
인천    11.171192
dtype: float64

In [58]:
rs["대구"]=1.4 #데이터 추가
rs

부산     1.630000
서울     3.169917
인천    11.171192
대구     1.400000
dtype: float64

In [59]:
del rs["서울"] #데이터 삭제

In [60]:
rs

부산     1.630000
인천    11.171192
대구     1.400000
dtype: float64

In [61]:
data = {
    "2015": [9904312, 3448737, 2890451, 2466052],
    "2010": [9631482, 3393191, 2632035, 2431774],
    "2005": [9762546, 3512547, 2517680, 2456016],
    "2000": [9853972, 3655437, 2466338, 2473990],
    "지역": ["수도권", "경상권", "수도권", "경상권"],
    "2010-2015 증가율": [0.0283, 0.0163, 0.0982, 0.0141]
}
columns = ["지역", "2015", "2010", "2005", "2000", "2010-2015 증가율"]
index = ["서울", "부산", "인천", "대구"]
df = pd.DataFrame(data, index=index, columns=columns)
df

     지역     2015     2010     2005     2000  2010-2015 증가율
서울  수도권  9904312  9631482  9762546  9853972         0.0283
부산  경상권  3448737  3393191  3512547  3655437         0.0163
인천  수도권  2890451  2632035  2517680  2466338         0.0982
대구  경상권  2466052  2431774  2456016  2473990         0.0141

In [62]:
df.values

array([['수도권', 9904312, 9631482, 9762546, 9853972, 0.0283],
       ['경상권', 3448737, 3393191, 3512547, 3655437, 0.0163],
       ['수도권', 2890451, 2632035, 2517680, 2466338, 0.0982],
       ['경상권', 2466052, 2431774, 2456016, 2473990, 0.0141]], dtype=object)

In [63]:
df.columns.name="특성"
df.index.name="도시"
df

특성   지역     2015     2010     2005     2000  2010-2015 증가율
도시
서울  수도권  9904312  9631482  9762546  9853972         0.0283
부산  경상권  3448737  3393191  3512547  3655437         0.0163
인천  수도권  2890451  2632035  2517680  2466338         0.0982
대구  경상권  2466052  2431774  2456016  2473990         0.0141

In [64]:
df.T #T:: 전치행렬

도시                  서울       부산       인천       대구
특성
지역                 수도권      경상권      수도권      경상권
2015           9904312  3448737  2890451  2466052
2010           9631482  3393191  2632035  2431774
2005           9762546  3512547  2517680  2456016
2000           9853972  3655437  2466338  2473990
2010-2015 증가율   0.0283   0.0163   0.0982   0.0141

In [65]:
df["지역"]

도시
서울    수도권
부산    경상권
인천    수도권
대구    경상권
Name: 지역, dtype: object

In [66]:
df[["2010","2015"]]

특성     2010     2015
도시
서울  9631482  9904312
부산  3393191  3448737
인천  2632035  2890451
대구  2431774  2466052

In [67]:
type(df[["2010"]])

pandas.core.frame.DataFrame

In [68]:
aci=pd.read_csv("data/2016_car_accident_per_month.csv", encoding='EUC-KR')
aci

      시도  시군구    월  발생건수  사망자수  부상자수  중상   경상  부상신고
0     서울  종로구  01월   105     0   143  37   93    13
1     서울  종로구  02월    75     1   103  33   62     8
2     서울  종로구  03월   113     0   145  37   93    15
3     서울  종로구  04월   119     0   149  31  108    10
4     서울  종로구  05월   151     0   189  52  119    18
5     서울  종로구  06월    95     1   135  22   88    25
6     서울  종로구  07월   122     1   175  34  121    20
7     서울  종로구  08월    96     0   135  24   86    25
8     서울  종로구  09월   102     2   138  30   93    15
9     서울  종로구  10월   106     1   146  30  103    13
10    서울  종로구  11월    98     0   133  32   83    18
11    서울  종로구  12월   117     3   157  39  102    16
12    서울   중구  01월    94     1   138  41   79    18
13    서울   중구  02월    84     0   111  35   67     9
14    서울   중구  03월   107     2   128  37   70    21
15    서울   중구  04월   129     1   169  42  106    21
16    서울   중구  05월   113     0   151  50   86    15
17    서울   중구  06월   102     0   144  40   92    12
18    서울   중구  07월   110     0   148  30  103    15
19    서울   중구  08월   106     1   146  31  100    15
20    서울   중구  09월   100     5   133  32   91    10
21    서울   중구  10월   136     4   172  41  111    20
22    서울   중구  11월   101     1   135  31   90    14
23    서울   중구  12월   106     2   141  37   94    10
24    서울  용산구  01월   101     0   134  29   96     9
25    서울  용산구  02월    81     0   119  28   84     7
26    서울  용산구  03월   111     2   157  42  109     6
27    서울  용산구  04월   142     2   176  41  125    10
28    서울  용산구  05월   134     0   195  52  132    11
29    서울  용산구  06월   107     0   146  39   95    12
...   ..  ...  ...   ...   ...   ...  ..  ...   ...
2713  울산   북구  07월    56     1    76  26   41     9
2714  울산   북구  08월    52     0    69  25   38     6
2715  울산   북구  09월    44     1    78  15   56     7
2716  울산   북구  10월    60     0    96  34   52    10
2717  울산   북구  11월    63     2   100  42   53     5
2718  울산   북구  12월    61     1    84  24   56     4
2719  울산  울주군  01월    70     4   132  29   82    21
2720  울산  울주군  02월    71     1   111  25   75    11
2721  울산  울주군  03월    84     3   117  37   62    18
2722  울산  울주군  04월    80     3   144  45   85    14
2723  울산  울주군  05월    76     1   130  39   71    20
2724  울산  울주군  06월    65     1   105  35   55    15
2725  울산  울주군  07월    79     0   119  34   70    15
2726  울산  울주군  08월    85     5   134  43   65    26
2727  울산  울주군  09월    75     1   124  29   70    25
2728  울산  울주군  10월    78    11   135  45   67    23
2729  울산  울주군  11월    81     1   121  28   70    23
2730  울산  울주군  12월    84     3   133  28   87    18
2731  세종   세종  01월    43     2    87  29   56     2
2732  세종   세종  02월    34     2    48   7   38     3
2733  세종   세종  03월    46     3    70  15   51     4
2734  세종   세종  04월    43     0    52  19   26     7
2735  세종   세종  05월    44     3    62  21   39     2
2736  세종   세종  06월    46     2    77  18   55     4
2737  세종   세종  07월    41     1    63  21   36     6
2738  세종   세종  08월    46     3    66  21   44     1
2739  세종   세종  09월    45     2    67  24   38     5
2740  세종   세종  10월    37     2    64  16   41     7
2741  세종   세종  11월    49     1    71  23   48     0
2742  세종   세종  12월    47     4    65  11   53     1

[2743 rows x 9 columns]

In [69]:

gr=aci.groupby(["월"])["발생건수"].mean()
#월 별 사고 발생건수
gr.plot()

In [70]:
h=aci.groupby(["시군구","월"])[["사망자수","부상자수"]]
h